In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
a=np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])

In [7]:
a

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [8]:
a[0]

array([1, 2, 3, 4])

In [9]:
a[1]

array([5, 6, 7, 8])

In [11]:
a[:[0]]

TypeError: slice indices must be integers or None or have an __index__ method

In [12]:
a[0,2]

3

In [13]:
a

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [15]:
a[:,0]

array([1, 5, 9])

In [20]:
ds=pd.Dataset(a)

AttributeError: module 'pandas' has no attribute 'Dataset'

In [21]:
df=pd.DataFrame(a)

In [22]:
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [24]:
df[0,:]

TypeError: '(0, slice(None, None, None))' is an invalid key

In [25]:
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [26]:
a

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [27]:
a[0]

array([1, 2, 3, 4])

In [28]:
df[0]

0    1
1    5
2    9
Name: 0, dtype: int32

In [32]:
df1=pd.DataFrame(a,'r0 r1 r2'.split(),'c0 c1 c2 c3'.split())

In [33]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [34]:
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [35]:
a

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [36]:
df1[r0]

NameError: name 'r0' is not defined

In [37]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [38]:
df1['r0']

KeyError: 'r0'

In [40]:
df1['c0']

r0    1
r1    5
r2    9
Name: c0, dtype: int32

In [41]:
a,df,df1

(array([[ 1,  2,  3,  4],
        [ 5,  6,  7,  8],
        [ 9, 10, 11, 12]]),    0   1   2   3
 0  1   2   3   4
 1  5   6   7   8
 2  9  10  11  12,     c0  c1  c2  c3
 r0   1   2   3   4
 r1   5   6   7   8
 r2   9  10  11  12)

In [44]:
s1=pd.Series(a)

Exception: Data must be 1-dimensional

In [45]:
s1=pd.Series([a])

In [47]:
s1

0    [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
dtype: object

In [48]:
a, df, df1, s1

(array([[ 1,  2,  3,  4],
        [ 5,  6,  7,  8],
        [ 9, 10, 11, 12]]),    0   1   2   3
 0  1   2   3   4
 1  5   6   7   8
 2  9  10  11  12,     c0  c1  c2  c3
 r0   1   2   3   4
 r1   5   6   7   8
 r2   9  10  11  12, 0    [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
 dtype: object)

In [49]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [50]:
df1+df1

    c0  c1  c2  c3
r0   2   4   6   8
r1  10  12  14  16
r2  18  20  22  24

In [51]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [52]:
df1['c4']=df1['c2']+df1['c3']

In [53]:
df1

    c0  c1  c2  c3  c4
r0   1   2   3   4   7
r1   5   6   7   8  15
r2   9  10  11  12  23

In [55]:
df1['c0']

r0    1
r1    5
r2    9
Name: c0, dtype: int32

In [57]:
df1.loc['r0']

c0    1
c1    2
c2    3
c3    4
c4    7
Name: r0, dtype: int32

In [59]:
df1.iloc[0]

c0    1
c1    2
c2    3
c3    4
c4    7
Name: r0, dtype: int32

df1

In [60]:
df1

    c0  c1  c2  c3  c4
r0   1   2   3   4   7
r1   5   6   7   8  15
r2   9  10  11  12  23

In [67]:
df1.drop('c4',axis=1,inplace=True)

In [66]:
 df1

    c0  c1  c2  c3  c4
r0   1   2   3   4   7
r1   5   6   7   8  15
r2   9  10  11  12  23

In [68]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [71]:
a[0]

array([1, 2, 3, 4])

In [72]:
s1[0]

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [73]:
s

KeyError: 1

In [78]:
df1.iloc[0][1]

2

In [79]:
df1.iloc[0]

c0    1
c1    2
c2    3
c3    4
Name: r0, dtype: int32

In [80]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [81]:
df1>4

       c0     c1     c2     c3
r0  False  False  False  False
r1   True   True   True   True
r2   True   True   True   True

In [88]:
df1['c0',df1['c0'>4]]

TypeError: '>' not supported between instances of 'str' and 'int'

In [89]:
df1[df1>4]

     c0    c1    c2    c3
r0  NaN   NaN   NaN   NaN
r1  5.0   6.0   7.0   8.0
r2  9.0  10.0  11.0  12.0

In [90]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [96]:
df1[df1['c0']>4]['c0']

r1    5
r2    9
Name: c0, dtype: int32

In [97]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [98]:
df1[>4]

SyntaxError: invalid syntax (<ipython-input-98-4a37a7529206>, line 1)

In [99]:
df1>4

       c0     c1     c2     c3
r0  False  False  False  False
r1   True   True   True   True
r2   True   True   True   True

In [100]:
df1[df1>4]

     c0    c1    c2    c3
r0  NaN   NaN   NaN   NaN
r1  5.0   6.0   7.0   8.0
r2  9.0  10.0  11.0  12.0

In [102]:
df1[df1>4].loc['r1']

c0    5.0
c1    6.0
c2    7.0
c3    8.0
Name: r1, dtype: float64

In [103]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [111]:
df2=pd.DataFrame([[8,7,15,15],[9,12,5,1],[13,15,16,18]],'r0 r1 r2'.split(),'c0 c1 c2 c3'.split())

In [107]:
a2=np.array([[8,7,15,15],[9,12,5,1],[13,15,16,18]])

In [108]:
a2

array([[ 8,  7, 15, 15],
       [ 9, 12,  5,  1],
       [13, 15, 16, 18]])

In [112]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [113]:
df2[df2>5]

    c0  c1    c2    c3
r0   8   7  15.0  15.0
r1   9  12   NaN   NaN
r2  13  15  16.0  18.0

In [114]:
df2[df2>5]['c2']

r0    15.0
r1     NaN
r2    16.0
Name: c2, dtype: float64

In [115]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [117]:
df2[df2>5]['c2']

r0    15.0
r1     NaN
r2    16.0
Name: c2, dtype: float64

In [119]:
df2['c2'>5]

TypeError: '>' not supported between instances of 'str' and 'int'

In [121]:
df2[df2>5]

    c0  c1    c2    c3
r0   8   7  15.0  15.0
r1   9  12   NaN   NaN
r2  13  15  16.0  18.0

In [122]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [125]:
df2[df2['c2']>5]['c3']

r0    15
r2    18
Name: c3, dtype: int64

In [126]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [131]:
df1['c1']

r0     2
r1     6
r2    10
Name: c1, dtype: int32

df2

In [132]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [137]:
df2[df2['c1']>10]

    c0  c1  c2  c3
r1   9  12   5   1
r2  13  15  16  18

In [145]:
df2[(df2['c1']>10 & df2['c0']>10)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [146]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [162]:
df2[(df2['c0']>8) & (df2['c2']>5)][['c0','c3']]

    c0  c3
r2  13  18

In [161]:
(df2['c0']>8) & (df2['c2']>5)

r0    False
r1    False
r2     True
dtype: bool

In [163]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [169]:
df2[['c0','c1']]

    c0  c1
r0   8   7
r1   9  12
r2  13  15

In [170]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [171]:
df.reset_index

<bound method DataFrame.reset_index of    0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12>

In [172]:
df2

    c0  c1  c2  c3
r0   8   7  15  15
r1   9  12   5   1
r2  13  15  16  18

In [175]:
df2.reset_index,inplace=True

TypeError: cannot unpack non-iterable bool object

In [178]:
df2.reset_index(inplace=True)

In [179]:
df2

  index  c0  c1  c2  c3
0    r0   8   7  15  15
1    r1   9  12   5   1
2    r2  13  15  16  18

In [180]:
df2['c4']='a b c'.split()

In [181]:
df2

  index  c0  c1  c2  c3 c4
0    r0   8   7  15  15  a
1    r1   9  12   5   1  b
2    r2  13  15  16  18  c

In [184]:
df2.set_index('c4',inplace=True)

In [183]:
df2

  index  c0  c1  c2  c3 c4
0    r0   8   7  15  15  a
1    r1   9  12   5   1  b
2    r2  13  15  16  18  c

In [185]:
df2

   index  c0  c1  c2  c3
c4
a     r0   8   7  15  15
b     r1   9  12   5   1
c     r2  13  15  16  18

In [186]:
df2

   index  c0  c1  c2  c3
c4
a     r0   8   7  15  15
b     r1   9  12   5   1
c     r2  13  15  16  18

In [187]:
df2['c4']=('ind','eng',np.nan)

In [188]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [190]:
df2.dropna()

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng

In [193]:
df2.fillna(value=0)

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18    0

In [194]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [197]:
df2.dropna(thresh=5)

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [196]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [198]:
df2.fillna(df2['c2'].mean())

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18   12

In [199]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [200]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [203]:
dict4={'player':['kohli','smith','root','smith','kohli','stokes'],
      'match':[1,1,1,2,2,2],
      'score':[30,40,50,60,20,10]}

In [204]:
dict4

{'player': ['kohli', 'smith', 'root', 'smith', 'kohli', 'stokes'],
 'match': [1, 1, 1, 2, 2, 2],
 'score': [30, 40, 50, 60, 20, 10]}

In [205]:
df3=pd.DataFrame(dict4)

In [206]:
df3

   player  match  score
0   kohli      1     30
1   smith      1     40
2    root      1     50
3   smith      2     60
4   kohli      2     20
5  stokes      2     10

In [208]:
gdf3=df3.groupby('player')

In [226]:
gdf3.mean()["score"]

player
kohli     25.0
root      50.0
smith     50.0
stokes    10.0
Name: score, dtype: float64

In [225]:
gdf3.describe()["score"]

        count  mean        std   min   25%   50%   75%   max
player
kohli     2.0  25.0   7.071068  20.0  22.5  25.0  27.5  30.0
root      1.0  50.0        NaN  50.0  50.0  50.0  50.0  50.0
smith     2.0  50.0  14.142136  40.0  45.0  50.0  55.0  60.0
stokes    1.0  10.0        NaN  10.0  10.0  10.0  10.0  10.0

In [227]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [228]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [233]:
pd.concat([df1,df2],sort=False)

    c0  c1  c2  c3 index   c4
r0   1   2   3   4   NaN  NaN
r1   5   6   7   8   NaN  NaN
r2   9  10  11  12   NaN  NaN
a    8   7  15  15    r0  ind
b    9  12   5   1    r1  eng
c   13  15  16  18    r2  NaN

In [234]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [235]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [238]:
pd.merge(df1,df2,how='outer',on='c0')

   c0  c1_x  c2_x  c3_x index  c1_y  c2_y  c3_y   c4
0   1   2.0   3.0   4.0   NaN   NaN   NaN   NaN  NaN
1   5   6.0   7.0   8.0   NaN   NaN   NaN   NaN  NaN
2   9  10.0  11.0  12.0    r1  12.0   5.0   1.0  eng
3   8   NaN   NaN   NaN    r0   7.0  15.0  15.0  ind
4  13   NaN   NaN   NaN    r2  15.0  16.0  18.0  NaN

In [239]:
df1, df2

(    c0  c1  c2  c3
 r0   1   2   3   4
 r1   5   6   7   8
 r2   9  10  11  12,    index  c0  c1  c2  c3   c4
 c4
 a     r0   8   7  15  15  ind
 b     r1   9  12   5   1  eng
 c     r2  13  15  16  18  NaN)

In [245]:
pd.merge(df1,df2,how='right',on='c0')

   c0  c1_x  c2_x  c3_x index  c1_y  c2_y  c3_y   c4
0   9  10.0  11.0  12.0    r1    12     5     1  eng
1   8   NaN   NaN   NaN    r0     7    15    15  ind
2  13   NaN   NaN   NaN    r2    15    16    18  NaN

In [241]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

In [242]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [247]:
pd.join(df1)

AttributeError: module 'pandas' has no attribute 'join'

In [250]:
df1

    c0  c1  c2  c3
r0   1   2   3   4
r1   5   6   7   8
r2   9  10  11  12

df2

In [251]:
df2

   index  c0  c1  c2  c3   c4
c4
a     r0   8   7  15  15  ind
b     r1   9  12   5   1  eng
c     r2  13  15  16  18  NaN

In [255]:
df1.join(df2)['c0'],['c1'],['c2],[c3']

ValueError: columns overlap but no suffix specified: Index(['c0', 'c1', 'c2', 'c3'], dtype='object')

In [253]:
df2.join(df1)

ValueError: columns overlap but no suffix specified: Index(['c0', 'c1', 'c2', 'c3'], dtype='object')

In [256]:
df3

   player  match  score
0   kohli      1     30
1   smith      1     40
2    root      1     50
3   smith      2     60
4   kohli      2     20
5  stokes      2     10

In [257]:
df4

NameError: name 'df4' is not defined

In [265]:
df4=pd.DataFrame({'custid':['1','2','3','4'],'custname':['oops','meera','sharvil','sphatika'],'age':[48,44,8,5]})

In [266]:
df4

  custid  custname  age
0      1      oops   48
1      2     meera   44
2      3   sharvil    8
3      4  sphatika    5

In [275]:
df5=pd.DataFrame({'custid':['1','6'],'custname':['oops','chellu'],'age':[48,78],'index':['a','e']})

In [276]:
df5

  custid custname  age index
0      1     oops   48     a
1      6   chellu   78     e

In [270]:
df4.join(df5,on='custid')

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [277]:
df5=pd.DataFrame({'custid':['1','6'],'custname':['oops','chellu'],'age':[48,78],'index':['a','e']})

In [278]:
df5

  custid custname  age index
0      1     oops   48     a
1      6   chellu   78     e

In [286]:
df4=pd.DataFrame({'custid':['1','2','3','4'],'custname':['oops','meera','sharvil','sphatika'],'age':[48,44,8,5]},index=['a','b','c','d'])

In [287]:
df4

  custid  custname  age
a      1      oops   48
b      2     meera   44
c      3   sharvil    8
d      4  sphatika    5

In [282]:
df4.join(df5,how='inner',on='index')

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [283]:
df4

  custid  custname  age index
0      1      oops   48     a
1      2     meera   44     b
2      3   sharvil    8     c
3      4  sphatika    5     d

In [284]:
df5

  custid custname  age index
0      1     oops   48     a
1      6   chellu   78     e

In [288]:
df4

  custid  custname  age
a      1      oops   48
b      2     meera   44
c      3   sharvil    8
d      4  sphatika    5

In [289]:
df5

  custid custname  age index
0      1     oops   48     a
1      6   chellu   78     e

In [290]:
df5=pd.DataFrame({'custid':['1','6'],'custname':['oops','chellu'],'age':[48,78]},index=['a','e'])

In [291]:
df5

  custid custname  age
a      1     oops   48
e      6   chellu   78

In [292]:
df4

  custid  custname  age
a      1      oops   48
b      2     meera   44
c      3   sharvil    8
d      4  sphatika    5

ValueError: columns overlap but no suffix specified: Index(['custid', 'custname', 'age'], dtype='object')

In [295]:
df4

  custid  custname  age
a      1      oops   48
b      2     meera   44
c      3   sharvil    8
d      4  sphatika    5

In [296]:
df5

  custid custname  age
a      1     oops   48
e      6   chellu   78

In [297]:
df4.join(df5,

ValueError: columns overlap but no suffix specified: Index(['custid', 'custname', 'age'], dtype='object')

In [298]:
df3

   player  match  score
0   kohli      1     30
1   smith      1     40
2    root      1     50
3   smith      2     60
4   kohli      2     20
5  stokes      2     10

In [317]:
df3['player'].value_counts()

kohli     2
smith     2
root      1
stokes    1
Name: player, dtype: int64

In [331]:
df3[(df3['score']>20) & (df3['player'] != 'stokes')]['score'].len()

AttributeError: 'Series' object has no attribute 'len'

In [326]:
def penalty (a):
    return (a-5)